// Задать номер четверти, показать диапазоны для возможных координат
Console.WriteLine("Введите номер четверти плоскости системы координат");
int a = int.Parse(Console.ReadLine() ?? "0");
if (a == 1)
    Console.WriteLine("Диапазон возможных координат: X > 0; Y > 0");
    if (a == 2)
    Console.WriteLine("Диапазон возможных координат: X < 0; Y > 0");
        if (a == 3)
        Console.WriteLine("Диапазон возможных координат: X < 0; Y < 0");
            if (a == 4)
            Console.WriteLine("Диапазон возможных координат: X > 0; Y < 0");